mach-systems/CANFD-LIN-Gateway/Drivers/stm32g474re_sd.c
        /* Send dummy byte for NWR timing : one byte between CMDWRITE and TOKEN */
        SD_IO_WriteDummy();
        SD_IO_WriteDummy();

        /* Send the data token to signify the start of the data */
        uint8_t tmp = (uint8_t)SD_TOKEN_START_DATA_SINGLE_BLOCK_WRITE;
        (void)BSP_SPI2_Send(&tmp, 1);

        (void)BSP_SPI2_SendRecv((uint8_t*)pData, ptr, BlockSize);

        /* Put CRC bytes (not really needed by us, but required by SD) */
        SD_IO_WriteDummy();
        SD_IO_WriteDummy();

        /* Read data response for this block write operation */
        if (SD_GetDataResponse() != (uint8_t)SD_DATA_OK)
        {
          /* Send dummy byte: 8 Clock pulses of delay */
          SD_CS_HIGH();
          SD_IO_WriteDummy();
	      return BSP_ERROR_COMPONENT_FAILURE;
        }
        SD_CS_HIGH();
        /* Send a dummy byte */
        SD_IO_WriteDummy();

    ret = BSP_ERROR_NONE;
  }

    /* Send dummy byte: 8 Clock pulses of delay */
    SD_CS_HIGH();
    SD_IO_WriteDummy();
    SD_IO_WriteDummy();
    /* Returns the response */
    return ret;
}

/**
  * @brief  Reads 1 block from a specified address in an SD card, in polling mode.
  * @param  Instance   SD Instance
  * @param  pData      Pointer to the buffer that will contain the readdata
  * @param  ReadAddr   address from where data is to be read
  *                    ReadAddr is a multiple of BlockSize
  * @param  BlockSize  Size of SD blocks to read that should be 512
  * @retval BSP status
  */
static int32_t SD_ReadBlock(uint32_t Instance, uint8_t* pData, uint32_t ReadAddr, uint16_t BlockSize)
{
  int32_t ret;
  SD_CmdAnswer_typedef response;

  if((Instance >= SD_INSTANCES_NBR) || ( BlockSize != SD_BLOCKSIZE))
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    uint8_t ptr[SD_BLOCKSIZE];

      SD_CS_LOW();
      SD_IO_WriteDummy();
      SD_IO_WriteDummy();

      /* in case of SDXC/SDHC cards, the BLOCK_LEN is set to 512
         so that CMD16 is not required */
      /* Send CMD16 (SD_CMD_SET_BLOCKLEN) to set the size of the block and
         Check if the SD acknowledged the set block length command: R1 response (0x00: no errors) */
      response = SD_SendCmd(SD_CMD_SET_BLOCKLEN, BlockSize, 0xFF, (uint8_t)SD_ANSWER_R1_EXPECTED);
      SD_CS_HIGH();
      SD_IO_WriteDummy();
      if ( response.r1 != (uint8_t)SD_R1_NO_ERROR)
      {
            /* Send dummy byte: 8 Clock pulses of delay */
            SD_CS_HIGH();
            SD_IO_WriteDummy();
	        return BSP_ERROR_COMPONENT_FAILURE;
      }
      /* Data transfer */
       for (uint32_t i = 0 ; i < SD_BLOCKSIZE ; i++)  { ptr[i] = SD_DUMMY_BYTE;}
        /* Send CMD17 (SD_CMD_READ_SINGLE_BLOCK) to read one block */
        /* Check if the SD acknowledged the read block command: R1 response (0x00: no errors) */
        response = SD_SendCmd(SD_CMD_READ_SINGLE_BLOCK, (ReadAddr * ((CardType == SD_CARD_SDHC) ? 1U: SD_BLOCKSIZE) / SD_BLOCKSIZE), 0xFF, (uint8_t)SD_ANSWER_R1_EXPECTED);
        if ( response.r1 != (uint8_t)SD_R1_NO_ERROR)
        {
            /* Send dummy byte: 8 Clock pulses of delay */
            SD_CS_HIGH();
            SD_IO_WriteDummy();
	        return BSP_ERROR_COMPONENT_FAILURE;
        }
        /* Now look for the data token to signify the start of the data */
        if (SD_WaitData(SD_TOKEN_START_DATA_SINGLE_BLOCK_READ) == BSP_ERROR_NONE)
        {
          /* Read the SD block data : read NumByteToRead data */
          if (BSP_SPI2_SendRecv(ptr, (uint8_t*)pData, BlockSize) != BSP_ERROR_NONE)
          {
            /* Send dummy byte: 8 Clock pulses of delay */
            SD_CS_HIGH();
            SD_IO_WriteDummy();
	        return BSP_ERROR_PERIPH_FAILURE;
          }
		  else
          {
            /* Send dummy byte: 8 Clock pulses of delay */
            SD_IO_WriteDummy();
            SD_IO_WriteDummy();
          }
        }
        else
        {
          /* Send dummy byte: 8 Clock pulses of delay */
          SD_CS_HIGH();
          SD_IO_WriteDummy();
	      return BSP_ERROR_COMPONENT_FAILURE;
        }
       /* get CRC bytes (not really needed by us, but required by SD) */
       SD_CS_HIGH();
       SD_IO_WriteDummy();
       /* Set response value to success */
       ret = BSP_ERROR_NONE;
  }
  /* End the command data read cycle */

    /* Send dummy byte: 8 Clock pulses of delay */
    SD_CS_HIGH();
    SD_IO_WriteDummy();

  /* Return the response */
  return ret;
}

/**
  * @brief  SD1 EXTI line detection callbacks.
  * @retval None
  */
static void SD1_EXTI_Callback(void)
{
  if (BSP_SD_IsDetected(0) == BSP_ERROR_NONE)
  {
    BSP_SD_DetectCallback(0, SD_PRESENT);
  }
  else
  {
    BSP_SD_DetectCallback(0, SD_NOT_PRESENT);
  }
  /* change Pin detection orientation */
  (void)BSP_SD_DetectITConfig(0);
}

/**
  * @brief  Read the CSD card register.
  *         Reading the contents of the CSD register in SPI mode is a simple
  *         read-block transaction.
  * @param  Csd pointer on an SCD register structure
  * @retval BSP status
  */
static int32_t SD_GetCSDRegister(SD_CardSpecificData_t* Csd)
{
  uint8_t counter;
  uint8_t CSD_Tab[16];
  int32_t retr = BSP_ERROR_PERIPH_FAILURE;
  SD_CmdAnswer_typedef response;

  /* SD chip select low */
  SD_CS_LOW();
  /* Send CMD9 (CSD register) and Wait for response in the R1 format (0x00 is no errors) */
  response = SD_SendCmd(SD_CMD_SEND_CSD, 0, 0xFF, (uint8_t)SD_ANSWER_R1_EXPECTED);

  if(response.r1 == (uint8_t)SD_R1_NO_ERROR)
  {
    if (SD_WaitData(SD_TOKEN_START_DATA_SINGLE_BLOCK_READ) == BSP_ERROR_NONE)
    {
      for (counter = 0; counter < (uint8_t)16; counter++)
      {
        /* Store CSD register value on CSD_Tab */
        CSD_Tab[counter] = SD_IO_ReadByte();
      }

      /* Get CRC bytes (not really needed by us, but required by SD) */
      SD_IO_WriteDummy();
      SD_IO_WriteDummy();

      retr = BSP_ERROR_NONE;

      /*************************************************************************
        CSD header decoding
      *************************************************************************/

      /* Byte 0 */
      Csd->CSDStruct = (CSD_Tab[0] & 0xC0U) >> 6;
      Csd->Reserved1 =  CSD_Tab[0] & 0x3FU;

      /* Byte 1 */
      Csd->TAAC = CSD_Tab[1];

      /* Byte 2 */
      Csd->NSAC = CSD_Tab[2];

