mach-systems/CANFD-LIN-Gateway/Drivers/stm32g474re_sd.c
  /* Send the command */
  SD_CS_LOW();
  /* Send the Cmd bytes */
  if (BSP_SPI2_SendRecv(frame, frameout, SD_CMD_LENGTH) == BSP_ERROR_NONE) 
  {
    switch(Answer)
    {
    case SD_ANSWER_R1_EXPECTED :
        retr.r1 = SD_ReadData();
        break;
    case SD_ANSWER_R1B_EXPECTED :
        retr.r1 = SD_ReadData();
        retr.r2 = SD_IO_WriteByte(SD_DUMMY_BYTE);
        /* Set CS High */
        SD_CS_HIGH();
        HAL_Delay(1);
        /* Set CS Low */
        SD_CS_LOW();

        /* Wait IO line return 0xFF */      
        while (( retr.r2 == (uint8_t)0) && (counter  < 200*SD_MAX_TRY))
        { 
          counter++;
          retr.r2 = SD_IO_WriteByte(SD_DUMMY_BYTE);
        }
        break;
    case SD_ANSWER_R2_EXPECTED :
        retr.r1 = SD_ReadData();
        retr.r2 = SD_IO_WriteByte(SD_DUMMY_BYTE);
        break;
    case SD_ANSWER_R3_EXPECTED :
    case SD_ANSWER_R7_EXPECTED :
        retr.r1 = SD_ReadData();
        retr.r2 = SD_IO_WriteByte(SD_DUMMY_BYTE);
        retr.r3 = SD_IO_WriteByte(SD_DUMMY_BYTE);
        retr.r4 = SD_IO_WriteByte(SD_DUMMY_BYTE);
        retr.r5 = SD_IO_WriteByte(SD_DUMMY_BYTE);
        break;
    default :
        break;
    }
  }
    return retr;
}

/**
  * @brief  Get SD card data response.
  * @retval The SD status: Read data response xxx0<status>1
  *         - status 010: Data accepted
  *         - status 101: Data rejected due to a crc error
  *         - status 110: Data rejected due to a Write error.
  *         - status 111: Data rejected due to other error.
  */
uint8_t SD_GetDataResponse(void)
{
  uint8_t dataresponse;
  uint8_t rvalue = (uint8_t)SD_DATA_OTHER_ERROR;

  dataresponse = SD_IO_WriteByte(SD_DUMMY_BYTE);
  (void)SD_IO_WriteByte(SD_DUMMY_BYTE); /* read the busy response byte*/
  /* Mask unused bits */
  switch (dataresponse & (uint8_t)0x1F)
  {
  case SD_DATA_OK:
    rvalue = (uint8_t)SD_DATA_OK;

    /* Set CS High */
    SD_CS_HIGH();
    /* Set CS Low */
    SD_CS_LOW();

    /* Wait IO line return 0xFF */
    while (SD_IO_WriteByte(SD_DUMMY_BYTE) != (uint8_t)0xFF) {};

    break;
  case SD_DATA_CRC_ERROR:
    rvalue =  (uint8_t)SD_DATA_CRC_ERROR;
    break;
  case SD_DATA_WRITE_ERROR:
    rvalue = (uint8_t)SD_DATA_WRITE_ERROR;
    break;
  default:
    break;
  }

  /* Wait null data
  while (SD_IO_ReadByte() != (uint8_t)0);*/
  /* Return response */
  return rvalue;
}

/**
  * @brief  Put SD in Idle state.
  * @retval BSP status
  */
static int32_t SD_GoIdleState(void)
{
  SD_CmdAnswer_typedef response;
  __IO uint8_t counter = 0;
  int32_t status = BSP_ERROR_NONE;

  /* Send CMD0 (SD_CMD_GO_IDLE_STATE) to put SD in SPI mode and
     wait for In Idle State Response (R1 Format) equal to 0x01 */
  /* CS is asserted (low) by SD_SendCmd during the reception of the reset cmd */
  do
  {
    counter++;
    response = SD_SendCmd(SD_CMD_GO_IDLE_STATE, 0, 0x95U, (uint8_t)SD_ANSWER_R1_EXPECTED);
    /* Wait for In Idle State Response (R1 Format) equal to 0x01 */
    SD_IO_CSState(1);
    SD_IO_WriteDummy(); 
    if(counter >= SD_MAX_TRY)
    {
        break;
    }
  }while(response.r1 != (uint8_t)SD_R1_IN_IDLE_STATE);

   HAL_Delay(10); /* insert delay for some slow cards */
   /* try another method for other SD cards */
   if((uint8_t)(response.r1 & 0xFFU) != (uint8_t)SD_R1_IN_IDLE_STATE )
   {
        counter = 0;
        /* Send the command */
        SD_CS_LOW();
        /* wait for more time to be compatible with some (init slow?) card */
        HAL_Delay(1); /* insert delay for some slow cards */
        /* Send CMD0 (SD_CMD_GO_IDLE_STATE) to put SD in SPI mode and
           Wait for In Idle State Response (R1 Format) equal to 0x01 */
        do {
             (void)SD_SendCmd(SD_CMD_GO_IDLE_STATE, 0, 0x95, (uint8_t)SD_ANSWER_NOT_EXPECTED);
             /* wait for more time to be compatible with some (init slow?) card */
             HAL_Delay(1); /* insert delay for some slow cards */
             /* Wait for In Idle State Response (R1 Format) equal to 0x01 */
             response = SD_WaitResponse((uint8_t)SD_ANSWER_R1_EXPECTED, (uint8_t)SD_R1_IN_IDLE_STATE);
             if(counter++ >= SD_MAX_TRY)
             {
               break;
             }
         } while (response.r1 != (uint8_t)SD_R1_IN_IDLE_STATE);
   }

   /* Send CMD8 (SD_CMD_SEND_IF_COND) to check the power supply status
      and wait until response (R7 Format) equal to 0xAA and */
   response = SD_SendCmd(SD_CMD_SEND_IF_COND, 0x1AA, 0x87, (uint8_t)SD_ANSWER_R7_EXPECTED);
   SD_CS_HIGH();
   SD_IO_WriteDummy();
   if((response.r1  & (uint8_t)SD_R1_ILLEGAL_COMMAND) == (uint8_t)SD_R1_ILLEGAL_COMMAND)
   {
        /* initialise card V1 */
        do
        {
            /* initialise card V1 */
            /* Send CMD55 (SD_CMD_APP_CMD) before any ACMD command: R1 response (0x00: no errors) */
            response = SD_SendCmd(SD_CMD_APP_CMD, 0x00000000, 0xFF, (uint8_t)SD_ANSWER_R1_EXPECTED);
            SD_CS_HIGH();
            SD_IO_WriteDummy();
            if(response.r1 != (uint8_t)SD_R1_IN_IDLE_STATE)
            {
                return BSP_ERROR_COMPONENT_FAILURE;
            }

            /* Send ACMD41 (SD_CMD_SD_APP_OP_COND) to initialize SDHC or SDXC cards: R1 response (0x00: no errors) */
            response = SD_SendCmd(SD_CMD_SD_APP_OP_COND, 0x00000000, 0xFF, (uint8_t)SD_ANSWER_R1_EXPECTED);
            SD_CS_HIGH();
            SD_IO_WriteDummy();
        }
        while(response.r1 == (uint8_t)SD_R1_IN_IDLE_STATE);
        CardType = (uint8_t)SD_CARD_SDSC;
   }
   else if(response.r1 == (uint8_t)SD_R1_IN_IDLE_STATE)
   {
        /* initialise card V2 */
        do {
            /* Send CMD55 (SD_CMD_APP_CMD) before any ACMD command: R1 response (0x00: no errors) */
            (void)SD_SendCmd(SD_CMD_APP_CMD, 0, 0xFF, (uint8_t)SD_ANSWER_R1_EXPECTED);
            SD_CS_HIGH();
            SD_IO_WriteDummy();

            /* Send ACMD41 (SD_CMD_SD_APP_OP_COND) to initialize SDHC or SDXC cards: R1 response (0x00: no errors) */
            response = SD_SendCmd(SD_CMD_SD_APP_OP_COND, 0x40000000, 0xFF, (uint8_t)SD_ANSWER_R1_EXPECTED);
            SD_CS_HIGH();
            SD_IO_WriteDummy();
        }
        while(response.r1 == (uint8_t)SD_R1_IN_IDLE_STATE);

        if((response.r1 & (uint8_t)SD_R1_ILLEGAL_COMMAND) == (uint8_t)SD_R1_ILLEGAL_COMMAND)
        {
            do {
                /* Send CMD55 (SD_CMD_APP_CMD) before any ACMD command: R1 response (0x00: no errors) */

                response = SD_SendCmd(SD_CMD_APP_CMD, 0, 0xFFU, (uint8_t)SD_ANSWER_R1_EXPECTED);
                SD_CS_HIGH();
                SD_IO_WriteDummy();
                if(response.r1 != (uint8_t)SD_R1_IN_IDLE_STATE)
                {
                    return BSP_ERROR_COMPONENT_FAILURE;
                }
                /* Send ACMD41 (SD_CMD_SD_APP_OP_COND) to initialize SDHC or SDXC cards: R1 response (0x00: no errors) */
                response = SD_SendCmd(SD_CMD_SD_APP_OP_COND, 0x00U, 0xFFU, (uint8_t)SD_ANSWER_R1_EXPECTED);
                SD_CS_HIGH();
                SD_IO_WriteDummy();
            }
            while(response.r1 == (uint8_t)SD_R1_IN_IDLE_STATE);
        }

        /* Send CMD58 (SD_CMD_READ_OCR) to initialize SDHC or SDXC cards: R3 response (0x00: no errors) */
        response = SD_SendCmd(SD_CMD_READ_OCR, 0x00000000, 0xFF, (uint8_t)SD_ANSWER_R3_EXPECTED);
        SD_CS_HIGH();
        SD_IO_WriteDummy();
        if(response.r1 != (uint8_t)SD_R1_NO_ERROR)
        {
            return BSP_ERROR_COMPONENT_FAILURE;
        }
        CardType = (uint8_t)((response.r2 & 0x0040U) >> 6);
   }
   else
   {
        return BSP_ERROR_COMPONENT_FAILURE;
   }

