mach-systems/CANFD-LIN-Gateway/Drivers/stm32g474re_sd.c
}

/**
  * @brief  DeInitializes the SD MSP.
  * @param  hsd SD handle
  * @retval None
  */
static void SD_Msp_DeInit(SD_HandleTypeDef *hsd)
{
  static DMA_HandleTypeDef dma_rx_handle;
  static DMA_HandleTypeDef dma_tx_handle;
  static DMA_HandleTypeDef dma_rx_handle2;
  static DMA_HandleTypeDef dma_tx_handle2;

    /* Disable NVIC for DMA transfer complete interrupts */
    HAL_NVIC_DisableIRQ(SD_SDMMC_DMAx_Rx_IRQn);
    HAL_NVIC_DisableIRQ(SD_SDMMC_DMAx_Tx_IRQn);

    /* Deinitialize the stream for new transfer */
    dma_rx_handle.Instance = SD_SDMMC_DMAx_Rx_STREAM;
    (void)HAL_DMA_DeInit(&dma_rx_handle);

    /* Deinitialize the stream for new transfer */
    dma_tx_handle.Instance = SD_SDMMC_DMAx_Tx_STREAM;
    (void)HAL_DMA_DeInit(&dma_tx_handle);
}
#endif /* USE_DMA */

/******************************** LINK SD Card ********************************/

/**
  * @brief  DeInitializes the SD Card and put it into StandBy State (Ready for
  *         data transfer).
  * @retval None
  */
void SD_IO_DeInit(void)
{
  HAL_GPIO_DeInit(SD_DETECT_GPIO_PORT, SD_DETECT_PIN);

  // inspired by implementation in adafruit_802_sd.c
  SD_CS_LOW();
  HAL_GPIO_DeInit(SD_CS_GPIO_PORT, SD_CS_PIN);
  /* SD_CS_GPIO Periph clock disable */
  SD_CS_GPIO_CLK_DISABLE() ;

  HAL_NVIC_DisableIRQ(SD_DETECT_EXTI_IRQn);
}

/**
  * @brief  Initializes Detect and CS pins
  *         for the SD Card put SD card in SPI mode
  * @retval None
  */
void SD_IO_Init(void)
{
  /* Configure SD_DETECT_PIN pin: SD Card detect pin  (on MFX) */
  GPIO_InitTypeDef  GPIO_InitStruct;
  GPIO_InitStruct.Pin = SD_DETECT_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(SD_DETECT_GPIO_Port, &GPIO_InitStruct);

  /* Configure SD_CS_PIN pin: SD Card CS pin */
  SD_CS_GPIO_CLK_ENABLE();
  GPIO_InitStruct.Pin = SD_CS_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(SD_CS_GPIO_PORT, &GPIO_InitStruct);

  /* Enable and set SD EXTI Interrupt to the lowest priority */
  //HAL_NVIC_SetPriority(SD_DETECT_EXTI_IRQn, 0x0F, 0);
  // do not enable the SD Detect interrupt
  //HAL_NVIC_EnableIRQ(SD_DETECT_EXTI_IRQn);

  /*---- This does not put SD in SPI mode, it is done elsewhere ----*/
  /* SD SPI Config */
  // not needed - spi already initialized in main.c
  //HAL_SPI_Init(&hspi2);
}

/**
  * @brief  set the Chip Select of the SD card according to val
  * @param val  0 or 1
  * @retval None
  */
void SD_IO_CSState(uint8_t val)
{
 if(val == (uint8_t)1U)
 {
    SD_CS_ON();
 }
 else
 {
    SD_CS_OFF();
 }
}

/**
  * @brief  Writes a byte on the SD.
  * @param  Data byte to send.
  * @retval None
  */
uint8_t SD_IO_WriteByte(uint8_t Data)
{
  uint8_t tmp;

  /* Send the byte */
  (void)BSP_SPI2_SendRecv(&Data, &tmp, 1);
  return tmp;
}

/**
  * @brief  Reads a byte on the SD.
  * @retval Data read on the SD card
  */
uint8_t SD_IO_ReadByte(void)
{
  uint8_t readvalue;

  (void)BSP_SPI2_Recv(&readvalue, 1);

  /* Return the shifted data */
  return readvalue;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
